Revit 2027 API
SpecTypeId.ThermalResistance Property
 Thermal Resistance, in discipline Energy.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ThermalResistance { get; }
Public Shared ReadOnly Property ThermalResistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ThermalResistance {
	ForgeTypeId^ get ();
}
static member ThermalResistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace